# Практическая работа

# Задача

Один из способов повысить эффективность взаимодействия банка с клиентами — отправлять предложение о новой услуге не всем клиентам, а только некоторым, которые выбираются по принципу наибольшей склонности к отклику на это предложение.

Задача заключается в том, чтобы предложить алгоритм, который будет выдавать склонность клиента к положительному или отрицательному отклику на предложение банка. Предполагается, что, получив такие оценки для некоторого множества клиентов, банк обратится с предложением только к тем, от кого ожидается положительный отклик.

Для решения этой задачи загрузите файлы из базы в Postgres.
Эта БД хранит информацию о клиентах банка и их персональные данные, такие как пол, количество детей и другие.

Описание таблиц с данными представлено ниже.

**D_work**

Описание статусов относительно работы:
- ID — идентификатор социального статуса клиента относительно работы;
- COMMENT — расшифровка статуса.


**D_pens**

Описание статусов относительно пенсии:
- ID — идентификатор социального статуса;
- COMMENT — расшифровка статуса.


**D_clients**

Описание данных клиентов:
- ID — идентификатор записи;
- AGE	— возраст клиента;
- GENDER — пол клиента (1 — мужчина, 0 — женщина);
- EDUCATION — образование;
- MARITAL_STATUS — семейное положение;
- CHILD_TOTAL	— количество детей клиента;
- DEPENDANTS — количество иждивенцев клиента;
- SOCSTATUS_WORK_FL	— социальный статус клиента относительно работы (1 — работает, 0 — не работает);
- SOCSTATUS_PENS_FL	— социальный статус клиента относительно пенсии (1 — пенсионер, 0 — не пенсионер);
- REG_ADDRESS_PROVINCE — область регистрации клиента;
- FACT_ADDRESS_PROVINCE — область фактического пребывания клиента;
- POSTAL_ADDRESS_PROVINCE — почтовый адрес области;
- FL_PRESENCE_FL — наличие в собственности квартиры (1 — есть, 0 — нет);
- OWN_AUTO — количество автомобилей в собственности.


**D_agreement**

Таблица с зафиксированными откликами клиентов на предложения банка:
- AGREEMENT_RK — уникальный идентификатор объекта в выборке;
- ID_CLIENT — идентификатор клиента;
- TARGET — целевая переменная: отклик на маркетинговую кампанию (1 — отклик был зарегистрирован, 0 — отклика не было).
    
    
**D_job**

Описание информации о работе клиентов:
- GEN_INDUSTRY — отрасль работы клиента;
- GEN_TITLE — должность;
- JOB_DIR — направление деятельности внутри компании;
- WORK_TIME — время работы на текущем месте (в месяцах);
- ID_CLIENT — идентификатор клиента.


**D_salary**

Описание информации о заработной плате клиентов:
- ID_CLIENT — идентификатор клиента;
- FAMILY_INCOME — семейный доход (несколько категорий);
- PERSONAL_INCOME — личный доход клиента (в рублях).


**D_last_credit**

Информация о последнем займе клиента:
- ID_CLIENT — идентификатор клиента;
- CREDIT — сумма последнего кредита клиента (в рублях);
- TERM — срок кредита;
- FST_PAYMENT — первоначальный взнос (в рублях).


**D_loan**

Информация о кредитной истории клиента:
- ID_CLIENT — идентификатор клиента;
- ID_LOAN — идентификатор кредита.

**D_close_loan**

Информация о статусах кредита (ссуд):
- ID_LOAN — идентификатор кредита;
- CLOSED_FL — текущий статус кредита (1 — закрыт, 0 — не закрыт).

Ниже представлен минимальный список колонок, которые должны находиться в итоговом датасете после склейки и агрегации данных. По своему усмотрению вы можете добавить дополнительные к этим колонки.

    - AGREEMENT_RK — уникальный идентификатор объекта в выборке;
    - TARGET — целевая переменная: отклик на маркетинговую кампанию (1 — отклик был зарегистрирован, 0 — отклика не было);
    - AGE — возраст клиента;
    - SOCSTATUS_WORK_FL — социальный статус клиента относительно работы (1 — работает, 0 — не работает);
    - SOCSTATUS_PENS_FL — социальный статус клиента относительно пенсии (1 — пенсионер, 0 — не пенсионер);
    - GENDER — пол клиента (1 — мужчина, 0 — женщина);
    - CHILD_TOTAL — количество детей клиента;
    - DEPENDANTS — количество иждивенцев клиента;
    - PERSONAL_INCOME — личный доход клиента (в рублях);
    - LOAN_NUM_TOTAL — количество ссуд клиента;
    - LOAN_NUM_CLOSED — количество погашенных ссуд клиента.

Будьте внимательны при сборке датасета: это реальные банковские данные, в которых могут наблюдаться дубли, некорректно заполненные значения или значения, противоречащие друг другу. Для получения качественной модели необходимо предварительно очистить датасет от такой информации.

## Задание 1

Соберите всю информацию о клиентах в одну таблицу, где одна строчка соответствует полной информации об одном клиенте.

In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [29]:
d_clients = pd.read_csv('data/D_clients.csv')
d_close_loan = pd.read_csv('data/D_close_loan.csv')
d_job = pd.read_csv('data/D_job.csv')
d_loan = pd.read_csv('data/D_loan.csv')
d_last_credit = pd.read_csv('data/D_last_credit.csv')
d_pens = pd.read_csv('data/D_pens.csv')
d_salary = pd.read_csv('data/D_salary.csv')
d_target = pd.read_csv('data/D_target.csv')
d_work = pd.read_csv('data/D_work.csv')

In [30]:
d_clients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16000 entries, 0 to 15999
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       16000 non-null  int64
 1   AGE                      16000 non-null  int64
 2   GENDER                   16000 non-null  int64
 3   EDUCATION                16000 non-null  object
 4   MARITAL_STATUS           16000 non-null  object
 5   CHILD_TOTAL              16000 non-null  int64
 6   DEPENDANTS               16000 non-null  int64
 7   SOCSTATUS_WORK_FL        16000 non-null  int64
 8   SOCSTATUS_PENS_FL        16000 non-null  int64
 9   REG_ADDRESS_PROVINCE     16000 non-null  object
 10  FACT_ADDRESS_PROVINCE    16000 non-null  object
 11  POSTAL_ADDRESS_PROVINCE  16000 non-null  object
 12  FL_PRESENCE_FL           16000 non-null  int64
 13  OWN_AUTO                 16000 non-null  int64
dtypes: int64(9), object(5)
memory usage: 1.7+ MB

In [31]:
d_clients.ID.value_counts().sum()

16000

In [32]:
d_clients.GENDER.value_counts()

GENDER
1    10452
0     5548
Name: count, dtype: int64

In [33]:
d_clients.AGE.value_counts()

AGE
26    511
27    508
30    490
31    488
34    479
33    478
32    466
35    462
24    454
25    453
29    452
38    451
37    437
39    433
28    433
40    422
36    402
23    398
42    394
45    382
41    382
44    377
48    375
52    372
49    368
51    365
50    365
56    357
53    355
43    350
47    332
46    328
54    309
22    307
55    300
58    298
57    295
59    227
61    219
60    217
62    154
63    146
64    132
65     45
66     17
21     14
67      1
Name: count, dtype: int64

Уникальных ID клиентов - 16000, полов - 2, возраст клиентов в диапазоне от 26 до 67, без выбросов. Будем использовать это как референс. А пока начнем собирать данные в одну таблицу. Для этого сначала сделаем merge таблиц d_loan и d_close_loan.

In [34]:
d_loan.head()

      ID_LOAN  ID_CLIENT
0  1753790658  106804370
1  1753790659  106804371
2  1753790660  106804372
3  1753790661  106804372
4  1753790662  106804373

In [35]:
d_close_loan.head()

      ID_LOAN  CLOSED_FL
0  1753790658          1
1  1753790659          1
2  1753790660          1
3  1753790661          0
4  1753790662          1

In [36]:
d_loan = pd.merge(d_loan, d_close_loan, on='ID_LOAN')

In [37]:
d_loan.head()

      ID_LOAN  ID_CLIENT  CLOSED_FL
0  1753790658  106804370          1
1  1753790659  106804371          1
2  1753790660  106804372          1
3  1753790661  106804372          0
4  1753790662  106804373          1

Видим, что у одного клиента может быть сразу несколько кредитов в разном статусе. Согласно условию задания, нужно отдельно выделить общее кол-во ссуд и отдельно - кол-во погашенных. Приступим.

In [38]:
d_loan['LOAN_NUM_TOTAL'] = d_loan.groupby('ID_CLIENT')['CLOSED_FL'].transform('size')
d_loan['LOAN_NUM_CLOSED'] = d_loan.groupby('ID_CLIENT')['CLOSED_FL'].cumsum()
d_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21126 entries, 0 to 21125
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_LOAN          21126 non-null  int64
 1   ID_CLIENT        21126 non-null  int64
 2   CLOSED_FL        21126 non-null  int64
 3   LOAN_NUM_TOTAL   21126 non-null  int64
 4   LOAN_NUM_CLOSED  21126 non-null  int64
dtypes: int64(5)
memory usage: 825.4 KB

In [39]:
d_loan.head()

      ID_LOAN  ID_CLIENT  CLOSED_FL  LOAN_NUM_TOTAL  LOAN_NUM_CLOSED
0  1753790658  106804370          1               1                1
1  1753790659  106804371          1               1                1
2  1753790660  106804372          1               2                1
3  1753790661  106804372          0               2                1
4  1753790662  106804373          1               1                1

Дропнем ненужные уже столбцы CLOSED_FL и ID_LOAN, а заодно и дубликаты по айди клиента:

In [40]:
d_loan = d_loan.drop(['CLOSED_FL', 'ID_LOAN'], axis=1).drop_duplicates(subset='ID_CLIENT', keep='first')\
    .reset_index(drop=True)

In [41]:
d_loan.head(5)

   ID_CLIENT  LOAN_NUM_TOTAL  LOAN_NUM_CLOSED
0  106804370               1                1
1  106804371               1                1
2  106804372               2                1
3  106804373               1                1
4  106804374               2                1

In [42]:
d_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15223 entries, 0 to 15222
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_CLIENT        15223 non-null  int64
 1   LOAN_NUM_TOTAL   15223 non-null  int64
 2   LOAN_NUM_CLOSED  15223 non-null  int64
dtypes: int64(3)
memory usage: 356.9 KB

Начинаем понемногу собирать таблицу. Проверим target.

In [43]:
d_target.head()

   AGREEMENT_RK  ID_CLIENT  TARGET
0      59910150  106804370       0
1      59910230  106804371       0
2      59910525  106804372       0
3      59910803  106804373       0
4      59911781  106804374       0

In [44]:
d_target.ID_CLIENT.duplicated().sum()

0

In [45]:
d_target.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15223 entries, 0 to 15222
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AGREEMENT_RK  15223 non-null  int64
 1   ID_CLIENT     15223 non-null  int64
 2   TARGET        15223 non-null  int64
dtypes: int64(3)
memory usage: 356.9 KB

Меньше, чем данных в таблице клиентов. Начинаем собирать dataframe воедино.

In [46]:
d_clients = d_clients.rename(columns={'ID':'ID_CLIENT'})
df = d_clients.merge(d_target, 'outer', 'ID_CLIENT')
df = df.merge(d_job, 'outer', 'ID_CLIENT')
df = df.merge(d_last_credit, 'outer', 'ID_CLIENT')
df = df.merge(d_loan[['LOAN_NUM_TOTAL', 'LOAN_NUM_CLOSED', 'ID_CLIENT']], 'outer', 'ID_CLIENT')
df = df.merge(d_salary, 'outer', 'ID_CLIENT')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16300 entries, 0 to 16299
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID_CLIENT                16300 non-null  int64
 1   AGE                      16300 non-null  int64
 2   GENDER                   16300 non-null  int64
 3   EDUCATION                16300 non-null  object
 4   MARITAL_STATUS           16300 non-null  object
 5   CHILD_TOTAL              16300 non-null  int64
 6   DEPENDANTS               16300 non-null  int64
 7   SOCSTATUS_WORK_FL        16300 non-null  int64
 8   SOCSTATUS_PENS_FL        16300 non-null  int64
 9   REG_ADDRESS_PROVINCE     16300 non-null  object
 10  FACT_ADDRESS_PROVINCE    16300 non-null  object
 11  POSTAL_ADDRESS_PROVINCE  16300 non-null  object
 12  FL_PRESENCE_FL           16300 non-null  int64
 13  OWN_AUTO                 16300 non-null  int64
 14  AGREEMENT_RK             15523 non-null  float64
 15  TARGET                   15523 non-null  float64
 16  GEN_INDUSTRY             14126 non-null  object
 17  GEN_TITLE                14126 non-null  object
 18  JOB_DIR                  14126 non-null  object
 19  WORK_TIME                14125 non-null  float64
 20  CREDIT                   15523 non-null  float64
 21  TERM                     15523 non-null  float64
 22  FST_PAYMENT              15523 non-null  float64
 23  LOAN_NUM_TOTAL           15523 non-null  float64
 24  LOAN_NUM_CLOSED          15523 non-null  float64
 25  FAMILY_INCOME            15523 non-null  object
 26  PERSONAL_INCOME          15523 non-null  float64
dtypes: float64(9), int64(9), object(9)
memory usage: 3.4+ MB

Чистим дату.

In [47]:
df = df.drop_duplicates(keep='first').reset_index(drop=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16000 entries, 0 to 15999
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID_CLIENT                16000 non-null  int64
 1   AGE                      16000 non-null  int64
 2   GENDER                   16000 non-null  int64
 3   EDUCATION                16000 non-null  object
 4   MARITAL_STATUS           16000 non-null  object
 5   CHILD_TOTAL              16000 non-null  int64
 6   DEPENDANTS               16000 non-null  int64
 7   SOCSTATUS_WORK_FL        16000 non-null  int64
 8   SOCSTATUS_PENS_FL        16000 non-null  int64
 9   REG_ADDRESS_PROVINCE     16000 non-null  object
 10  FACT_ADDRESS_PROVINCE    16000 non-null  object
 11  POSTAL_ADDRESS_PROVINCE  16000 non-null  object
 12  FL_PRESENCE_FL           16000 non-null  int64
 13  OWN_AUTO                 16000 non-null  int64
 14  AGREEMENT_RK             15223 non-null  float64
 15  TARGET                   15223 non-null  float64
 16  GEN_INDUSTRY             13856 non-null  object
 17  GEN_TITLE                13856 non-null  object
 18  JOB_DIR                  13856 non-null  object
 19  WORK_TIME                13855 non-null  float64
 20  CREDIT                   15223 non-null  float64
 21  TERM                     15223 non-null  float64
 22  FST_PAYMENT              15223 non-null  float64
 23  LOAN_NUM_TOTAL           15223 non-null  float64
 24  LOAN_NUM_CLOSED          15223 non-null  float64
 25  FAMILY_INCOME            15223 non-null  object
 26  PERSONAL_INCOME          15223 non-null  float64
dtypes: float64(9), int64(9), object(9)
memory usage: 3.3+ MB

In [48]:
df.sample(1)

,ID_CLIENT,AGE,GENDER,EDUCATION,MARITAL_STATUS,CHILD_TOTAL,DEPENDANTS,SOCSTATUS_WORK_FL,SOCSTATUS_PENS_FL,REG_ADDRESS_PROVINCE,...,GEN_TITLE,JOB_DIR,WORK_TIME,CREDIT,TERM,FST_PAYMENT,LOAN_NUM_TOTAL,LOAN_NUM_CLOSED,FAMILY_INCOME,PERSONAL_INCOME
15590,106806572,51,1,Среднее специальное,Состою в браке,2,0,1,0,Тюменская область,...,Служащий,Пр-техн. обесп. и телеком.,150.0,10910.0,6.0,2000.0,1.0,0.0,от 20000 до 50000 руб.,8700.0

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16000 entries, 0 to 15999
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID_CLIENT                16000 non-null  int64
 1   AGE                      16000 non-null  int64
 2   GENDER                   16000 non-null  int64
 3   EDUCATION                16000 non-null  object
 4   MARITAL_STATUS           16000 non-null  object
 5   CHILD_TOTAL              16000 non-null  int64
 6   DEPENDANTS               16000 non-null  int64
 7   SOCSTATUS_WORK_FL        16000 non-null  int64
 8   SOCSTATUS_PENS_FL        16000 non-null  int64
 9   REG_ADDRESS_PROVINCE     16000 non-null  object
 10  FACT_ADDRESS_PROVINCE    16000 non-null  object
 11  POSTAL_ADDRESS_PROVINCE  16000 non-null  object
 12  FL_PRESENCE_FL           16000 non-null  int64
 13  OWN_AUTO                 16000 non-null  int64
 14  AGREEMENT_RK             15223 non-null  float64
 15  TARGET                   15223 non-null  float64
 16  GEN_INDUSTRY             13856 non-null  object
 17  GEN_TITLE                13856 non-null  object
 18  JOB_DIR                  13856 non-null  object
 19  WORK_TIME                13855 non-null  float64
 20  CREDIT                   15223 non-null  float64
 21  TERM                     15223 non-null  float64
 22  FST_PAYMENT              15223 non-null  float64
 23  LOAN_NUM_TOTAL           15223 non-null  float64
 24  LOAN_NUM_CLOSED          15223 non-null  float64
 25  FAMILY_INCOME            15223 non-null  object
 26  PERSONAL_INCOME          15223 non-null  float64
dtypes: float64(9), int64(9), object(9)
memory usage: 3.3+ MB

Отличный набор данных!.. который нам для конкретного задания не нужен. Безжалостно дропаем избыточные столбцы и проверяем, как дела у оставшихся.

In [50]:
needed_ones = ['AGREEMENT_RK', 'TARGET', 'AGE', 'SOCSTATUS_WORK_FL', 'SOCSTATUS_PENS_FL',\
    'GENDER', 'CHILD_TOTAL', 'DEPENDANTS', 'PERSONAL_INCOME', 'LOAN_NUM_TOTAL',\
        'LOAN_NUM_CLOSED']

In [51]:
df = df[needed_ones]
df = df.drop_duplicates(keep='first')

In [52]:
df = df.loc[df['TARGET'].notna()]
df[needed_ones] = df[needed_ones].astype('int64')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15223 entries, 0 to 15999
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   AGREEMENT_RK       15223 non-null  int64
 1   TARGET             15223 non-null  int64
 2   AGE                15223 non-null  int64
 3   SOCSTATUS_WORK_FL  15223 non-null  int64
 4   SOCSTATUS_PENS_FL  15223 non-null  int64
 5   GENDER             15223 non-null  int64
 6   CHILD_TOTAL        15223 non-null  int64
 7   DEPENDANTS         15223 non-null  int64
 8   PERSONAL_INCOME    15223 non-null  int64
 9   LOAN_NUM_TOTAL     15223 non-null  int64
 10  LOAN_NUM_CLOSED    15223 non-null  int64
dtypes: int64(11)
memory usage: 1.4 MB

Впоследствие можно будет сюда вернуться и сделать все по красоте с моделью и всеми сопутствующими - но дедлайн уже просрочен...

In [53]:
df.shape

(15223, 11)

In [54]:
df.to_csv("clients.csv", sep=";")